app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.author = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Blablabla"], ["created_at", Thu, 02 Aug 2012 13:20:27 UTC +00:00], ["name", "Test"], ["title", "je teste le posting"], ["updated_at", Thu, 02 Aug 2012 13:20:27 UTC +00:00]]