app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "name" = 'Ludovic Laffineur', "nickname" = 'Lud''s', "kot" = '3e etage balcon du haut', "studies" = 'Ingénieur Industriel Informatique', "birthday" = '2012-06-14 18:59:00.000000', "updated_at" = '2012-08-02 19:01:13.429655' WHERE "users"."id" = 1
---
  def update
     @user = User.find(current_user.id)
      if @user.update_attributes(params[:user])